["Complete a summary of the conversation._3", "后  记_3", "Unit 3_3", "Section A, 1b_3", "Write a weather report with the information from your table in 3b. Give your report to the class._3", "Imagine you have found an item at a sports centre. Make up a conversation with a partner. Use the expressions to help you._3", "Write a reply to Eric as Dr Know. Give him some advice._3", "In groups, think of a place or situation where the story took place. Share any interesting or special experiences. Use the questions to help you._3", "Read the post again and answer the questions._3", "Read the diary entry again and answer the questions._3", "Section A, 2a and 2d_3", "Read the video script and add the times from 1a into the text._3", "Unit 8_3", "In groups, take turns to think of an animal. Describe it. Guess one another’s animals and write them down in the table._3", "Complete the jokes with the correct forms of the nouns in brackets._3", "Section A, 2a and 2c_3", "1. 现在进行时的意义_3", "Weather and Mood_3", "In groups, brainstorm three rules for one of the places below. Then draw signs to show the rules. Share your signs in class and explain what they mean._3", "1. 副词的用法和意义_3", "Read the sentences. Underline the structures for the present continuous tense._3", "Listen to the conversation and fill in the blanks._3", "Unit 4_3", "Complete the passage with the correct forms of the words in brackets._3", "H_3", "Read Lisa’s diary entry and answer the questions._3", "The Joy Clinic wants teenagers to share their eating habits. Read Lisa’s post. How many eating habits does Lisa write about? What are they?_3", "Complete Helen’s and Peter’s descriptions about their trip. Then use $\\circleddash$ or $\\circledddot$ to show how they feel._3", "Write a diary entry about the school trip. Use your notes in 2a and the expressions to help you._3", "Complete the short story  with the correct forms of the verbs in brackets._3", "Read the article again and answer the questions._3", "G_3", "二、形容词（Adjectives）_3", "Section A, 1b, 1c, and 1d_3", "Complete the table with the information from the article._3", "In pairs, take turns miming different activities and guessing what they are._3", "Complete the passage with the words in the box._3", "Read the posts by Helen and Peter. Are they visiting the same place? Do they feel the same about it?_3", "F_3", "Choose the correct forms of the verbs._3", "In groups, ask one another how you keep fit. Take notes and give a report._3", "Match the characters with their opinions. Can you give these characters any advice? Share your ideas._3", "Food Myths_3", "Section A, 1b and 1c_3", "Read the text and correct the statements._3", "Read again and complete the table._3", "What food and drink would you and your partner like to order at a restaurant? Take notes and discuss your ideas. You can use the words to help you._3", "2. 名词复数_3", "Write a brief report for your group. Then present it to the class._3", "Read the video scripts. Who do you think is saying the sentences?_3", "Read the sentences. What tenses do they use? When do you use each tense?_3", "Complete the conversations with the correct forms of the verbs in brackets._3", "Talk about a school trip you took to a special place._3", "Work in pairs. Role-play a telephone conversation. Use the telephone expressions to help you._3", "Complete the letter to Dr Know using can, haveto/must, or can’t/mustn’t._3", "Section A, 1b and 1c Conversation 1_3", "In this unit, you will_2", "Draw a map of your zoo and present it to the class. Use the map and the expressions in the box to help you. Vote for the zoo you like._3", "2. 现在进行时的构成_3", "E_3", "Wednesday, 22 July_3", "2. 频度副词_3", "K_3", "Make the nouns in the box plural. Then use the plural nouns to complete the sentences._3", "3c Complete the postcard with the correct forms of the verbs in brackets._3", "Make notes about your last school trip._3", "Look and share_2", "五、物主代词（Possessive Pronouns）_2", "3d Think of an animal. Ask and answer questions with a partner to guess each other’s animal._3", "Read the sentences. Decide what the pronouns in bold refer to. Circle the adverbs of frequency and put them in order from the least to the most often._3", "In groups,  choose one goal that you hope your class can achieve._3", "Share your rules in class. Vote for your favourite set of class rules._3", "致同学_3", "Listen to the teacher’s instructions. Answer the questions._3", "Read the article from a clinic’s newsletter. How many poor eating habits are mentioned?_3", "Unit 2_3", "Which characters from the story do you think said the sentences?_3", "Look at the clocks and talk about the times in different places._3", "Complete the mind map with the information from the post._3", "Imagine you are calling a friend. Your friend is having a holiday in a place with different weather. Ask and answer questions using the ideas from 2d and the expressions below to help you._3", "Unit 5_3", "Complete the sentences with the correct forms of the verbs in the box._3", "Why do you like animals?_2", "Read the conversation. Then complete the table._3", "A_3", "Read the letters again and complete Alice’s notes about her problem._3", "Complete the sentences using can, haveto/must, or can’t/mustn’t._3", "Read the story again and answer the questions._3", "2 Read the text again and answer the questions._3", "1. can 和 could 的用法_3", "Choose three important rules from 2a. Discuss the questions with a partner._3", "Complete the passage with the correct forms of the verbs in the box._3", "表3  现在进行时的肯定式和否定式_3", "Complete the conversation with the words in the box. Underline the animal nouns._3", "Read the story adapted from Hans Christian Andersen’s TheUglyDuckling. Discuss the question with a partner._3", "Listen to the conversation again and match the stress patterns below with the coloured sentences. Then role-play the conversation._3", "2 Think of some memorable events. What was special about them? Share your story._3", "Do you keep a diary? Do you think it is a good idea to keep a diary? Discuss your ideas with a partner. Use the points to help you._3", "Talk about your own eating habits. Use the questions to help you._3", "Complete the passage with the correct forms of the verbs in brackets._3", "Read the sentences. Circle all  the nouns for food and drink. Are they countable or uncountable in the context?_3", "Read the conversation. Circle T for true, F for false, or NG for not given._3", "Section A, 1c_3", "Read Malee’s post and choose the best title for it._3", "Unit 7_3", "Complete the passage with always, usualy, sometimes, seldom, or never._3", "Read the text and answer the questions._3", "2 Use a dictionary to help you match the weather idioms with their meanings. Then find more weather idioms and share them with a partner._3", "Read the posts again. Complete the questions with the question words in the box and then answer them._3", "A website wants to learn more about how teenagers keep fit. Read Kate’s post and complete the mind map._3", "Read again and answer the questions._3", "Read Alice’s letter to Dr Know and Dr Know’s reply. Then answer the questions._3", "Visiting New Places_3", "英语_3", "Emma is sharing a  story with her class. Listen and circle the coloured words you hear._3", "Read three students’ accounts of their ways to keep fit. Fill in the blanks with useanexerciseap , skateboarding,  or playbasebal._3", "In pairs, ask each other about the activities you did yesterday and what time you did them. Then tell the class about your partner’s day._3", "四、情态动词（Modal Verbs）_2", "Complete the passage with the correct forms of the nouns in brackets._3", "Read the sentences. Circle the verbs in the simple past tense. Then underline the time expressions for the past._3", "Put the words in order. Write the sentences using the correct tenses._3", "Write a post about your favourite animal. Use the questions to help you._3", "Role-play a conversation between a customer and a waiter or waitress at a restaurant._3", "Read the sentences. Do the verbs in bold need to change forms? Why?_3", "Listen to the conversation again and pay attention to the stressed words._3", "Imagine that your friends are at your home. Offer them food and drink._3", "Read the conversation and complete the table._3", "D_3", "Read Sam’s diary entry and write a one-sentence summary of what he did on that day._3", "Look at the first sign and read the rules. Then write the rules for the other signs._3", "表2  物主代词的分类_3", "In groups, ask your group members questions about their favourite sport or exercise. Take notes in the table._3", "Unit 6_3", "Listen to the conversation between Jane and her family back in the UK. Fill in the blanks._3", "Share your favourite story. Tell your classmates why you like it._3", "The Ugly Duckling_3", "2. may 的用法_3", "Read the accounts again and complete the table._3", "Complete the conversations with the correct pronouns._3", "Read the weather information and report about Chengdu. Underline the information from the table in the report._3"]