["Unit 8 Our Blue Planet_3", "Li Xiang’s family camping_2", "Benef its of  following rules_2", "5. 爆破 （Plosion）_3", "Activity  4 Complete the main idea and detail chart according to the text._3", "Pronunciation_2", "Reading Strategies_2", "Unit 10_3", "Unit 11_3", "J_3", "6. 节奏（Rhythm）_3", "Infinitive Past tense不定式 过去式_3", "Activity  2 Fill in the blanks with the correct form of the given words._3", "Activity  2 Scan the text and check your prediction._3", "Words in Each Unit各单元词汇表_2", "U_3", "Exploring the Topic_2", "Unit 11 Rules Matter!_3", "O_3", "Activity  4 Complete the cause and effect chart according to the text._3", "Activity  3 Report the survey results to the class._3", "Activity  4 Read the text and complete the reading tasks._3", "Q_3", "Grammar in Use_2", "Ⅲ. 连词（Conjunction）_3", "4. 弱读（Weak Form）_3", "后      记_1", "M_3", "Activity  3 Read the text again and complete the main idea of each paragraph._3", "Activity  3 Read the text again and answer the questions._3", "How to be a smart shopper_2", "Making rules_2", "Activity  2 Read the text and visualize what you read._3", "Activity  2 Read the text and underline what makes you picture something in your mind._3", "R_3", "Activity  3 Pair work. Look at the pictures and talk about how to protect our planet by using imperative sentences._3", "Activity  2 Read the text and complete the sequence chain of transportation development._3", "Classroom Rules_2", "3. 成节音（Syllabic）_3", "Activity  2_3", "Thinking Skills_2", "Unit 8_3", "Activity  3 Draft your essay about your trip in Activity 2._3", "UNIT_1", "A community service activity_2", "Activity  3 Draft your essay about a community service activity._3", "Theme Reading_2", "Unit 7 Being a Smart Shopper_3", "Unit 9_3", "Activity  4 Pair work. Read the text and then share your ideas about saving water by answering the questions._3", "Activity  2 Read the text and draw a chart to show how the plot develops._3", "E_3", "Activity  3 Complete the story withand/but/or._3", "7. 意群（Sense Group）_3", "Quantifiers_2", "Activity  3 Read the text and tick( $\\checkmark$ ) the correct words._3", "UNIT 11_1", "Activity  2 Read the title and predict what the text is about, and then read the text and check your prediction._3", "Infinitive Past tense_3", "Activity  3_3", "Activity  2 Read the whole text and check your prediction in Activity 1._3", "Unit 12 Better Together_3", "Activity  2 Read the text and answer the questions._3", "Big Question: Why is water important?_2", "Activity  3 Complete the sentences with the numbers in the brackets._3", "Big Question: How can you spend money wisely?_2", "Activity  4 Complete the character trait chart according to the text._3", "Activity  3 Complete the text withand/but/or._3", "G_3", "Activity  1 Look at the picture and read the text. Learn how to analyze character traits._3", "Sharing your trip experience_2", "Activity  1 Skim the text and underline the main idea._3", "Review_2", "H_3", "Activity  1_3", "Activity  5 Pair work. Discuss the questions with your partner._3", "L_3", "Activity  4 Pair work. Talk about your school rules. The following sentences may help you._3", "S_3", "Activity  3 Complete the conversations withsome/any/howmany/howmuch._3", "Unit 10 Lending a Helping Hand_3", "Activity  3 Pair work. Complete the table with the clues in the text, and then tell your partner how you make the inferences._3", "Activity  4 Fill in the blanks (1–4) with the sentences  (A–E) in the box. There is one extra sentence._3", "Reflexive  pronouns_2", "Activity  2 Read the sentences and fill in the blanks according to the pictures._3", "Activity  3 Complete the email with the correct form of the words in the box._3", "Activity  4 Complete the problem and solution chart and retell the text._3", "Activity  1 Pair work. Talk about how you can help others in your daily life. Add more ideas in the blanks._3", "Attached Word List 附表单词_2", "Activity  2 Complete the table and learn how to usehowmanyandhow much._3", "K_3", "Activity  1 Pair work. Listen to the conversation and answer the questions, and then share your opinions about volunteer activities._3", "Big Question: Why do we need rules?_2", "Activity  2 Read the text and complete the cause and effect chart._3", "Every drop counts_2", "Activity  3 Listen and read, and then mark T (True) or F (False)._3", "Activity  4 Pair work. Look at the map and read the directions, and then ask and answer the questions._3", "Activity  2 Rewrite the sentences with the words or phrases in the brackets._3", "Activity  1 Pair work. Read the conversation. Pay attention to the imperative sentences._3", "Activity  2 Fill in the blanks according to the signs._3", "Big Question: What can make your trip safe and fun?_2", "Prepositions_2", "Activity  3 Share the map of your community in class._3", "Activity  3 Fill in the blanks withshouldorshouldn’tand put the rules in each suitable box._3", "Activity  3 Read the chant and answer the questions._3", "Activity  3 Pair work. Raise some questions before, during and after reading the text and ask your partner to answer the questions._3", "Activity  4 Read the text and answer the questions._3", "W_3", "The suffix -ly_2", "Unit 7_3", "N_3", "Activity  4 Complete the plot chart according to the text._3", "1. 单词重音（Word Stress）_3", "Male Names_3", "Activity  3 Read the text and fill in the blanks with the correct form of the given words._3", "Listening & Speaking_2", "Big Question: Why is teamwork important?_2", "Activity  3 Read the text and circle what Xiao Lin buys and underline what her mom buys._3", "Activity  2 Read the numbers and complete the table._3", "Activity  2 Look at the pictures and complete the text with the correct form of the phrases in the box._3", "Activity  2 Group work. Share your experience of a teamwork activity. The following questions may help you._3", "Activity  4 Pair work. Talk about the questions and make up a new conversation about water._3", "Activity  2 Read the map and complete the sentences with the phrases in the box._3", "Unit 9 From Here to There_3", "Activity  3 Pair work. Complete the conversation and then practice with your partner._3", "Activity  5 Fill in the blanks with the phrases from the text._3", "Possessive pronouns_2", "Names of Places地名表_3", "Activity  3 Draft your essay about how to be a smart shopper._3", "Vocabulary词汇表_2", "Function_2", "Teamwork_2", "Unit 12_3", "Activity  2 Skim and scan the text to answer the questions._3", "Oral Communication_2", "Activity  2 Group work. Talk about your experience as a volunteer and report it to your class. The following activities and questions may help you._3", "Unit 7 at a time 每次 （16）_3", "C_3", "Ⅳ. 介词 (Preposition)_3", "Activity  3 Listen and repeat. Mark T for the same pronunciation and F for different pronunciations of the colored letters in each group._3", "Activity  2 Complete the table and learn how to usemust/mustn’tand should/shouldn’t._3", "Activity  5 Fill in the blanks with the correct form of the words and phrases in the box._3", "Big Question: What makes a community?_2", "Activity  4 Read the sentences aloud and mark the liaisons $( \\quad )$ , and then listen and check._3", "2. 句子重音 （Sentence Stress）_3", "I_3", "Activity  2 Match the following information to make complete sentences._3", "Irregular Verbs不规则动词表_2", "Activity  3 Pair work. Raise questions with the given words and phrases according to the answers, and then ask and answer with your partner._3", "Activity  4 Read the advertisement and complete the table._3", "Activity  2 Complete the word puzzle according to the text, and then circle the title of the passage in the puzzle._3", "Activity  2 Read the text and complete the problem and solution chart._3", "Project_2", "UNIT 7_1", "A football match_2", "Activity  2 Read the text and complete the main idea and detail chart._3", "D_3", "Activity  1 Pair work. Look at the map of Xinhua Community and answer the questions._3", "Activity  1 Pair work. Read the conversation. Pay attention to the usage of modal verbs._3", "Moving to a new community_2", "Activity  2 Complete the table and learn how to use the simple past tense._3", "Y_3", "F_3", "Activity  3 Match the phrases with the sentences according to the text._3", "How to Be a Smart Shopper_2", "Activity  2 Group work. Share an unforgettable trip with your parents. The following questions may help you._3", "Activity  5 Complete the sentences with the correct form of the phrases in the box._3", "Activity  4 Pair work. Talk about what you need and then make a conversation._3", "祈使句（The imperative sentence）_3", "Activity  3 Report your teamwork activity to the class._3", "Activity  2 Read the text and tick ( $\\checkmark 1$ ) the answers._3", "Activity  4 Read the text. Pay attention to the liaisons and stresses._3", "Activity  2 Scan the text above and answer the question._3", "P_3", "Activity  3 Read the text again and mark T (True) or F (False)._3", "Activity  3 Look at the pictures and complete the text with the correct form of the given words._3", "Activity  2 Read the text and complete the character trait chart._3", "Project Making a survey of community life_2", "Activity  1 Look at the pictures about a teamwork activity and answer the questions._3", "V_3"]